app/controllers/centro_saluds_controller.rb

SELECT "centro_saluds".* FROM "centro_saluds"
---
  def index
    @centro_saluds = CentroSalud.all

INSERT INTO "centro_saluds" ("ciudad", "created_at", "descripcion", "direccion", "direccion_fiscal", "email", "estado", "fax", "nombre", "rif", "sitio_web", "telefono", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @centro_salud = CentroSalud.new(centro_salud_params)
    @centro_salud.usuario_id = params[:usuario_id_aux]
    @usuario=Usuario.find(params[:usuario_id_aux])
    @usuario.tipo_usuario = 2
    @centro_salud.nombre = @usuario.nombre

    respond_to do |format|
      if @centro_salud.save

SELECT  "centro_saluds".* FROM "centro_saluds"  WHERE "centro_saluds"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_centro_salud
      @centro_salud = CentroSalud.find(params[:id])