app/controllers/medicos_controller.rb

SELECT "medicos".* FROM "medicos"
---
  def index
    @medicos = Medico.all

SELECT  "medicos".* FROM "medicos"  WHERE "medicos"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @medico = Medico.find(params[:id])

INSERT INTO "medicos" ("apellido", "cedula", "cmv", "created_at", "cv", "direccion", "email", "especialidad", "fecha_nacimiento", "nombre", "sexo", "telefono_casa", "telefono_celular", "telefono_oficina", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @medico = Medico.new(medico_params)
    @medico.usuario_id = params[:usuario_id_aux]
    @usuario = Usuario.find(params[:usuario_id_aux])
    @medico.nombre=@usuario.nombre
    respond_to do |format|
      if not_update_tipo_usuario
        if @medico.save

UPDATE "medicos" SET "updated_at" = ?, "url" = ? WHERE "medicos"."id" = 2  [["updated_at", "2014-07-23 13:49:26.904873"], ["url", "www.joseaguilar.com"]]
---
  def update
    respond_to do |format|
      if @medico.update(medico_params)

DELETE FROM "medicos" WHERE "medicos"."id" = ?  [["id", 1]]
---
  def destroy
    @medico.destroy

SELECT  "medicos".* FROM "medicos"  WHERE "medicos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_medico
      @medico = Medico.find(params[:id])